<a href="https://colab.research.google.com/github/Karlitos982/GeekBrains/blob/master/GB_NumPy_(task_1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Задания NumPy

In [1]:
import numpy as np

##### Задание 1 #####

In [2]:
a = np.array([[1, 6], [2, 8], [3, 11], [3, 10], [1,7]])
print(a)

[[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

In [3]:
mean_a = a.mean(axis=0)
print(mean_a)

[2.  8.4]

###### Задание 2

In [5]:
a_centered = np.array([a.transpose()[0] - mean_a[0], a.transpose()[1] - mean_a[1]]).transpose()
print(a_centered)

[[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

###### Задание 3

In [6]:
a_centered_sp = np.dot(a_centered.transpose()[0], a_centered.transpose()[1])
a_centered_sp = a_centered_sp / (len(a)-1)
print(a_centered_sp)

2.0

###### Задание 4

In [7]:
print(np.cov(a.transpose())[0, 1] == a_centered_sp)

True

## Задания Pandas

In [8]:
import pandas as pd

##### Задание 1

In [9]:
autors = {
    "autor_id": [1, 2, 3],
    "autor_name": ['Тургенев', 'Чехов', 'Островский']
}
autors = pd.DataFrame(autors)
autors

   autor_id  autor_name
0         1    Тургенев
1         2       Чехов
2         3  Островский

In [10]:
book = {
    "autor_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
}
book = pd.DataFrame(book)
book

   autor_id            book_title  price
0         1           Отцы и дети    450
1         1                 Рудин    300
2         1     Дворянское гнездо    350
3         2      Толстый и тонкий    500
4         2       Дама с собачкой    450
5         3                 Гроза    370
6         3  Таланты и поклонники    290

##### Задание 2

In [11]:
autors_prise = pd.merge(autors, book, on='autor_id', how='inner')
autors_prise

   autor_id  autor_name            book_title  price
0         1    Тургенев           Отцы и дети    450
1         1    Тургенев                 Рудин    300
2         1    Тургенев     Дворянское гнездо    350
3         2       Чехов      Толстый и тонкий    500
4         2       Чехов       Дама с собачкой    450
5         3  Островский                 Гроза    370
6         3  Островский  Таланты и поклонники    290

##### Задание 3

In [12]:
top5 = autors_prise.sort_values(by='price', ascending=False)[:5]
top5

   autor_id  autor_name         book_title  price
3         2       Чехов   Толстый и тонкий    500
0         1    Тургенев        Отцы и дети    450
4         2       Чехов    Дама с собачкой    450
5         3  Островский              Гроза    370
2         1    Тургенев  Дворянское гнездо    350

##### Задание 4

In [13]:
a = autors_prise.groupby("autor_name")
min_price = a.agg({"price": "min"})
min_price.rename(columns = {'price':'min_price'}, inplace = True)
mean_price = a.agg({"price": "mean"})
mean_price.rename(columns = {'price':'mean_price'}, inplace = True)
max_price = a.agg({"price": "max"})
max_price.rename(columns = {'price':'max_price'}, inplace = True)

autors = autors_prise['autor_name'].drop_duplicates()

authors_stat = pd.merge(autors, min_price, on='autor_name', how='left')
authors_stat = pd.merge(authors_stat, mean_price, on='autor_name', how='left')
authors_stat = pd.merge(authors_stat, max_price, on='autor_name', how='left')
authors_stat

   autor_name  min_price  mean_price  max_price
0    Тургенев        300  366.666667        450
1       Чехов        450  475.000000        500
2  Островский        290  330.000000        370